{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ben Throop&#x27;s Blog",
    "description": "",
    "home_page_url": "https://benthroop.github.io",
    "feed_url": "https://benthroop.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ben"
    },
    "items": [
        {
            "id": "https://benthroop.github.io/setting-up-this-blog-for-editing-on-all-of-my-computers/",
            "url": "https://benthroop.github.io/setting-up-this-blog-for-editing-on-all-of-my-computers/",
            "title": "Setting up this blog for editing on all of my computers.",
            "summary": "So yeah I'm using Publii for this and I have been really wringing my hands over it, but today I got editing of the content from multiple computers working well. Publii is like a really stripped down and simplified Wordpress, but instead of requiring an&hellip;",
            "content_html": "<p>So yeah I'm using Publii for this and I have been really wringing my hands over it, but today I got editing of the content from multiple computers working well. Publii is like a really stripped down and simplified Wordpress, but instead of requiring an entire stack of server based tech, it is just a program you can install on Windows.</p>\n<p>This might seem like a step backwards if you can only edit your stuff from one computer, but fortunately, it's possible to store the source data in Dropbox and sync it between more than one machine. </p>\n<p>Anyway I don't really want to make this entire blog about having a blog, but after facing nightmare scenario of using Jekyll and writing posts in Markdown (yeesh), this is amazing.</p>\n<p>To make this post not a complete waste, here's the entrance to Unity '09 in San Francisco. Unity spared no expense. I think this was the Unite where they announced a free version.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://benthroop.github.io/media/posts/2/SANY0094.JPG\" sizes=\"(min-width: 61.3125em) 50vw, 100vw\" srcset=\"https://benthroop.github.io/media/posts/2/responsive/SANY0094-xs.JPG 300w ,https://benthroop.github.io/media/posts/2/responsive/SANY0094-sm.JPG 480w ,https://benthroop.github.io/media/posts/2/responsive/SANY0094-md.JPG 768w\"  alt=\"\"></figure>",
            "author": {
                "name": "Ben"
            },
            "tags": [
            ],
            "date_published": "2020-07-31T09:38:06-04:00",
            "date_modified": "2020-07-31T09:38:06-04:00"
        },
        {
            "id": "https://benthroop.github.io/and-so-it-begins/",
            "url": "https://benthroop.github.io/and-so-it-begins/",
            "title": "And so it begins.",
            "summary": "I've always wanted to be free with sharing what I'm doing, but there's always been a reason why I didn't. NDAs and employment agreements at Sony and Activision make employees invisible. I left that life in 2015, but right after got so deep into making&hellip;",
            "content_html": "<p>I've always wanted to be free with sharing what I'm doing, but there's always been a reason why I didn't. NDAs and employment agreements at Sony and Activision make employees invisible. I left that life in 2015, but right after got so deep into making <a href=\"http://headmastergame.com\">Headmaster</a> that I didn't dedicate the time. I think there is a saying about planting a tree, and yesterday, and something. It's a very smart saying. You can imagine.</p>\n<p>Anyway, I've started to get busy doing my own stuff again. It's exciting and scary, but I'm determined to not hermit again.</p>\n<p>It's been a few weeks and I've been tinkering on some code... an old little space shooter project that I'm fixing up like a beat up car. I want to talk about it a bit, so here we go. </p>\n<p>BTW this blog is built with a thing called <a href=\"https://getpublii.com/\">Publii</a>. It's like Wordpress, but the app is on your computer and it generates the site as html/css. It seems cool, so giving it a shot. I gave \"fancy\" static site generators like Jekyll and Hugo a good look, but you have to be a web head to get these things. Ain't got time for that. </p>\n<p>Let's test a GIF:</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://benthroop.github.io/media/posts/1/PARTYMODE-GIF-RobertWheel.gif\" alt=\"\"></figure>\n<p> </p>\n<p>And a Youtube Embed:</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/4vKQUiiC7jg\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Keeping it fast and loose. </p>",
            "image": "https://benthroop.github.io/media/posts/1/jail.jpeg",
            "author": {
                "name": "Ben"
            },
            "tags": [
            ],
            "date_published": "2020-07-31T09:38:06-04:00",
            "date_modified": "2020-07-31T09:38:06-04:00"
        }
    ]
}
